using System.Dynamic;

namespace MyClasses
{
    public class Japanese : Language
    {
        private static char[] hiragana = { 'あ', 'い', 'う', 'え', 'お', 'か', 'き', 'く', 'け', 'こ', 'さ', 'し', 'す', 'せ', 'そ', 'た', 'ち', 'つ', 'て', 'と', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'ま', 'み', 'む', 'め', 'も', 'や', 'ゆ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'わ', 'を', 'ん' };
        private static char[] katakana = { 'ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'キ', 'ク', 'ケ', 'コ', 'サ', 'シ', 'ス', 'セ', 'ソ', 'タ', 'チ', 'ツ', 'テ', 'ト', 'ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 'ハ', 'ヒ', 'フ', 'ヘ', 'ホ', 'マ', 'ミ', 'ム', 'メ', 'モ', 'ヤ', 'ユ', 'ヨ', 'ラ', 'リ', 'ル', 'レ', 'ロ', 'ワ', 'ヲ', 'ン' };

        private static char[] kanji = { '一', '二', '三', '四', '五', '六', '七', '八', '九', '十', '百', '千', '万', '億', '兆', '京', '壱', '弐', '参', '壹', '貳', '肆', '伍', '陸', '漆', '捌', '玖', '拾', '佰', '仟', '萬', '廿', '卅', '卌', '皕', '皷', '万', '億', '兆', '京', '壱', '弐', '参', '壹', '貳', '肆', '伍', '陸', '漆', '捌', '玖', '拾', '佰', '仟', '萬', '廿', '卅', '卌', '皕', '皷', '壱', '弐', '参', '壹', '貳', '肆', '伍', '陸', '漆', '捌', '玖', '拾', '佰', '仟', '萬', '廿', '卅', '卌', '皕', '皷', '壱', '弐', '参', '壹', '貳', '肆', '伍', '陸', '漆', '捌', '玖', '拾', '佰', '仟', '萬', '廿', '卅', '卌', '皕', '皷', '壱', '弐', '参', '壹', '貳', '肆', '伍', '陸', '漆', '捌', '玖', '拾', '佰', '仟', '萬', '廿', '卅', '卌', '皕', '皷' };

        private static char[] allChars = [];

        public override string Hello() => "こんにちは";

        private static char[] createAllChars()
        {
            return allChars.Concat(hiragana).Concat(katakana).Concat(kanji).ToArray();
        }
        
        public Japanese() : base(createAllChars()) {}
    }
}